[[["cf991a9e-80ee-4bb7-9af3-fe15f821f888",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\nMaxyn Leitner\nUniversity of Southern California Information Sciences\nInstitute\nLos Angeles, California, USA\nmaxynrl@isi.edu\nRebecca Dorn\nUniversity of Southern California Information Sciences\nInstitute\nLos Angeles, California, USA\nrdorn@isi.edu\nFred Morstatter\nUniversity of Southern California Information Sciences\nInstitute\nLos Angeles, California, USA\nfredmors@isi.edu\nKristina Lerman\nUniversity of Southern California Information Sciences\nInstitute\nLos Angeles, California, USA\nlerman@isi.edu\nAbstract\nContent Warning: Trans-antagonistic Rhetoric and Terminology\nThe recent proliferation of short form video social media sites such\nas TikTok has been effectively utilized for increased visibility, com-\nmunication, and community connection amongst trans/nonbinary\ncreators online. However, these same platforms have also been\nexploited by right-wing actors targeting trans/nonbinary people,","metadata":{"loc":{"lines":{"from":1,"to":28}}}}],["1dfbdfaa-4f61-4083-9289-27d41a1ed180",{"pageContent":"munication, and community connection amongst trans/nonbinary\ncreators online. However, these same platforms have also been\nexploited by right-wing actors targeting trans/nonbinary people,\nenabling such anti-trans actors to efficiently spread hate speech\nand propaganda. Given these divergent groups, what are the dif-\nferences in network structure between anti-trans and pro-trans\ncommunities on TikTok, and to what extent do they amplify the\neffects of anti-trans content? In this paper, we collect a sample of\nTikTok videos containing pro and anti-trans content, and develop\na taxonomy of trans related sentiment to enable the classification\nof content on TikTok, and ultimately analyze the reply network\nstructures of pro-trans and anti-trans communities. In order to ac-\ncomplish this, we worked with hired expert data annotators from\nthe trans/nonbinary community in order to generate a sample of\nhighly accurately labeled data. From this subset, we utilized a novel","metadata":{"loc":{"lines":{"from":26,"to":40}}}}],["4e05a8ac-d926-445e-8132-e73e0986aa82",{"pageContent":"complish this, we worked with hired expert data annotators from\nthe trans/nonbinary community in order to generate a sample of\nhighly accurately labeled data. From this subset, we utilized a novel\nclassification pipeline leveraging Retrieval-Augmented Generation\n(RAG) with annotated examples and taxonomy definitions to clas-\nsify content into pro-trans, anti-trans, or neutral categories. We\nfind that incorporating our taxonomy and its logics into our clas-\nsification engine results in improved ability to differentiate trans\nrelated content, and that Results from network analysis indicate\nmany interactions between posters of pro-trans and anti-trans con-\ntent exist, further demonstrating targeting of trans individuals, and\ndemonstrating the need for better content moderation tools.\nCCS Concepts\n•Human-centered computing→Collaborative and social\ncomputing;•Computing methodologies→Natural language\nprocessing;•Networks→Network analysis;•Information\nsystems→Retrieval tasks and goals.","metadata":{"loc":{"lines":{"from":38,"to":54}}}}],["dd577af5-5f79-4223-a578-cacd6b695a04",{"pageContent":"•Human-centered computing→Collaborative and social\ncomputing;•Computing methodologies→Natural language\nprocessing;•Networks→Network analysis;•Information\nsystems→Retrieval tasks and goals.\nKeywords\nOnline Harassment, Computational Social Science, Classification,\nNetwork analysis, Retrieval-Augmented Generation (RAG), Large\nlanguage models (LLMs), Community Dynamics\n1  Introduction\nTikTok’s distinctive algorithmic and community dynamics make\nit a compelling case for studying the dual role of social media in\nfostering community-building and enabling targeted harassment,\nespecially for marginalized groups like trans and nonbinary people.\nPlatforms like TikTok allow trans/nonbinary creators to connect,\nshare affirmations of identity, and disseminate essential resources\nabout healthcare [4] and support systems [15]. Simultaneously,\nthese platforms facilitate the proliferation of anti-trans rhetoric,\nweaponized by malign actors to spread hate speech and amplify\nharmful stereotypes [76].","metadata":{"loc":{"lines":{"from":51,"to":69}}}}],["10a01030-76d8-4d45-9bf3-ee1e2a0c290e",{"pageContent":"these platforms facilitate the proliferation of anti-trans rhetoric,\nweaponized by malign actors to spread hate speech and amplify\nharmful stereotypes [76].\nThis work contributes to the understanding and modeling of\nthese dynamics through three key innovations. First, we introduce a\ncomprehensive taxonomy of sentiment toward trans and nonbinary\ncommunities, grounded in sociological and gender studies frame-\nworks. This taxonomy addresses critical gaps in prior frameworks\nby including underexamined subcategories such as transmisogyny,\nanti-transmasculinity, and exorsexism, enabling a detailed and in-\ntersectional understanding of trans-related sentiment. This enables\na more granular analysis of online discourse and its impact on\nmarginalized communities.\nSecond, we develop a novel classification pipeline to identify\npro-trans, anti-trans, and neutral content on TikTok, introducing\na state-of-the-art classification pipeline that combines Retrieval-","metadata":{"loc":{"lines":{"from":67,"to":82}}}}],["4b46b8f0-6f95-43c8-bb2f-3c05c651ae28",{"pageContent":"Second, we develop a novel classification pipeline to identify\npro-trans, anti-trans, and neutral content on TikTok, introducing\na state-of-the-art classification pipeline that combines Retrieval-\nAugmented Generation (RAG) with curated annotated examples\nand taxonomy definitions, setting a new benchmark for classifying\nnuanced trans-related sentiment. Our RAG system is armed with\ntwo key resources: a curated set of annotated examples and the\ndefinitions from extant literature relating to our taxonomy. These\nresources not only guide the LLM’s contextual understanding but\nalso significantly improve classification accuracy, especially in dis-\ntinguishing nuanced pro-trans and anti-trans sentiments.\nFinally, we apply our classification and taxonomy to analyze\nthe reply network structures of pro-trans and anti-trans actors\non TikTok. By comparing these network dynamics, we reveal the\nmechanisms by which anti-trans content proliferates and the struc-","metadata":{"loc":{"lines":{"from":80,"to":94}}}}],["3dadba37-cba4-4149-903a-04f27d619392",{"pageContent":"the reply network structures of pro-trans and anti-trans actors\non TikTok. By comparing these network dynamics, we reveal the\nmechanisms by which anti-trans content proliferates and the struc-\ntural characteristics that amplify its reach. This analysis informs\npotential strategies to mitigate online harms while empowering\ntrans and nonbinary communities in digital spaces.\narXiv:2501.16507v1  [cs.HC]  27 Jan 2025","metadata":{"loc":{"lines":{"from":92,"to":98}}}}],["f58bbc6f-00d0-4591-8c0b-774717765b5e",{"pageContent":"Maxyn Leitner, Rebecca Dorn, Fred Morstatter, and Kristina Lerman\nBy combining sociological theory, novel computational tech-\nniques, and network analysis, this paper contributes a robust frame-\nwork for studying the dynamics of marginalized communities and\ntheir adversaries in online ecosystems. These contributions ad-\nvance the field of computational social science and offer actionable\nstrategies for combating online harassment.\n2  Background and Related Work\n2.1  Anti-Trans Rhetoric Online\nDue to its rapid proliferation and popularity across generational\nand political lines, TikTok makes for an incredibly effective social\nmedia space to analyze anti-trans and pro-trans content, as well as\nthe ways in which they interact. To begin, TikTok has served as a\nbattle ground on which progressive views, particularly with respect\nto trans/non-binary people, have been scrutinized and exposed\nto attack from right wing actors [16,39]. Right Wing content is","metadata":{"loc":{"lines":{"from":100,"to":115}}}}],["78804179-5270-4164-80e1-6a378d2ae6e4",{"pageContent":"battle ground on which progressive views, particularly with respect\nto trans/non-binary people, have been scrutinized and exposed\nto attack from right wing actors [16,39]. Right Wing content is\nincredibly popular on TikTok, and is often formatted in an attempt\nto appeal to the platform’s younger user base [3,82]. In concert with\nthis, a combination of TikTok’s content moderation approaches\nand recommendation algorithms often results in users being served\nincreasingly right wing content, and anti-trans rhetoric serves as\neffective entry into that pipeline [14, 57].\n2.2  Trans and Gender Diverse TikTok Users\nStructural forces such as content recommendation systems work\nat odds with trans/non-binary users, who report a lack of agency\nover being shown content that maligns their identities and con-\nvictions in ways that affect their beliefs about themselves [21,29].\nIn the face of this opposition, trans/non-binary users persist and","metadata":{"loc":{"lines":{"from":113,"to":127}}}}],["7ba03287-ce4f-4cc2-b0b6-b859dcd490c4",{"pageContent":"over being shown content that maligns their identities and con-\nvictions in ways that affect their beliefs about themselves [21,29].\nIn the face of this opposition, trans/non-binary users persist and\nform folk theories in order to resist prevailing anti-trans narra-\ntives. Where anti-trans actors are motivated to falsely report queer\ncontent as inappropriate as a way of training TikTok’s content rec-\nommendation algorithms [23], queer and trans users build and test\ntheories of how to influence said algorithms in the other direction,\ntowards greater visibility and acceptance of their identities [48].\nTransfeminine users have reported an awareness of how having\ntheir content promoted by the algorithm both opens them up to\ngreater risk of attack from anti-trans actors, but also greater op-\nportunity, moderating the former through strategies DeVito calls\nalgorithmic trapdoors[60]. Given this landscape, TikTok is an\nimportant and illustrative platform on which to investigate the","metadata":{"loc":{"lines":{"from":125,"to":139}}}}],["10d6aeb1-2ca9-4458-901f-9f975dea6b5e",{"pageContent":"portunity, moderating the former through strategies DeVito calls\nalgorithmic trapdoors[60]. Given this landscape, TikTok is an\nimportant and illustrative platform on which to investigate the\ndifferences in network structure between anti-trans and pro-trans\ncommunities.\n2.3  Perspectives of Trans Sentiment\nPrevious work in classifying trans sentiment has mainly focused\non the detection of anti-trans sentiment[17,58]. However, these at-\ntempts fail to distinguish details in which trans people are targeted,\nand either presume or fail to analyze the identity of the source of\nanti-trans content, at the risk of visibilizing some forms of anti-\ntrans sentiment over others. Given the painted heterogeneity of\ntrans identities and experiences, previous taxonomy studies are\nlimited both in the diversity of their subject pool and the specificity\nof anti-trans sentiment characterized [20].\n3  Theoretical Grounding for a Trans\nSentiment Taxonomy","metadata":{"loc":{"lines":{"from":137,"to":153}}}}],["350965a2-6a2f-4188-9086-bdb600d81943",{"pageContent":"limited both in the diversity of their subject pool and the specificity\nof anti-trans sentiment characterized [20].\n3  Theoretical Grounding for a Trans\nSentiment Taxonomy\nWe derive a taxonomy characterizing sentiment towards trans and\ngender diverse individuals in order to better understand and analyze\nonline harms and social dynamics surrounding trans people. This\nwork follows taxonomy design guidance [54], including specifying\nthe taxonomy’s goal and purpose, outlining qualitative techniques\nused, and evaluating the taxonomy’s usefulness. We begin with\ntwo particular articles which outline forms of Anti-Transgender\nsentiment that are frequently overlooked [53,64]. Based on these\nsources, we continuously expand our search terms as more rele-\nvant articles are defined. Search terms used include “cissexism\",\n“transandrophobia\" and “transmisogyny.\" See an extended list of\nsearch terms in the Datasheet.\n1\nRelevance and NeutralityIn societies constructed around cis binary","metadata":{"loc":{"lines":{"from":150,"to":167}}}}],["cb70bcf0-0674-4050-8611-373a9c70ad8c",{"pageContent":"“transandrophobia\" and “transmisogyny.\" See an extended list of\nsearch terms in the Datasheet.\n1\nRelevance and NeutralityIn societies constructed around cis binary\ngender as a norm, the consistency of anti-trans biases and the era-\nsure of trans people from consideration can have significant impacts\n[8,13]. Relatedly, research looking at trans-related sentiment in\npublic opinion have struggled to find “neutral\" coverage due to\nincreasing polarization along ideology [45]. Both of these realities\nare accurately inscribed by the minority stress model [59] along-\nside the concept of “cis-normativity” [31,49,74]. Combined with\nthe prominent idea that all sides of an issue are equally morally\nvalent (“both sideology\"), equivocating views that cause differing\ndegrees of material harm [47], we are called to rethink the concept\nof \"neutrality\" in this context. In the scope of this work, we con-\nsider content “Neutral\" on trans issues when it is truly irrelevant to","metadata":{"loc":{"lines":{"from":164,"to":179}}}}],["72c0c384-03c6-4801-b896-e270983b70fd",{"pageContent":"of \"neutrality\" in this context. In the scope of this work, we con-\nsider content “Neutral\" on trans issues when it is truly irrelevant to\ntrans issues. Only content that is trans related is considered under\neither primary label Anti-Trans or Pro-Trans. At a secondary tier,\nwe consider a breakdown of specific kinds of Pro-Trans and Anti-\nTrans content via specific sub-categories. These sub-categories are\nnon-exclusive, meaning any particular message could be labeled\nwith none, one or multiple secondary labels.\nAnti-TransIn evaluating offensive content, situational context dras-\ntically changes harm [85]. We draw from seminal media literacy\nfoundations, which posits that media sources have particular moti-\nvations and that the meaning of messages is altered by the consumer\n[46]. Accordingly, we incorporate context into our Anti-Trans sen-\ntiment label by considering two different aspects of the message in\nquestion: the message’s target, and the source of the message.","metadata":{"loc":{"lines":{"from":178,"to":192}}}}],["d2fc8ba7-97b9-4b74-8455-95aaa38f6462",{"pageContent":"[46]. Accordingly, we incorporate context into our Anti-Trans sen-\ntiment label by considering two different aspects of the message in\nquestion: the message’s target, and the source of the message.\nFor target, we value specificity in order to make visible targets\nof anti-trans sentiment that are currently understudied such as\ntransmasculine [5,6], non-binary [19,67], and intersex people [51].\nFurther, increased coverage helps to accurately capture specific\nways that more hypervisible gender diverse people, namely trans-\nfeminine people [34], are targeted, and how this intersects with\nrace (Blackness in particular) to form both heightened hypervis-\nible precarity and “hyperinvisibility” [2,50]. For source, we con-\nsider the ways in which supposedly opposing groups collaborate in\ntrans-antagonism [66,72], and also to accurately identify anti-trans\ncontent even when coming from members of the community.\nWith respect to the message’s target, we thus consider the follow-","metadata":{"loc":{"lines":{"from":190,"to":204}}}}],["01f02c28-f8cc-4ab7-858a-0da8bd524007",{"pageContent":"trans-antagonism [66,72], and also to accurately identify anti-trans\ncontent even when coming from members of the community.\nWith respect to the message’s target, we thus consider the follow-\ning sub labels:Transmisogyny,Anti-Transmasculinity or Transan-\ndrophobia, andExorsexism.Transmisogyny, coined by Julia Serano\n1\nhttps://github.com/maxynrl/TransTikTokDatasheet","metadata":{"loc":{"lines":{"from":202,"to":208}}}}],["351161ee-2079-4f3f-abd0-2640589a1595",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\n[74], is a form of transantagonism targeting trans women and trans-\nfeminine people The introductory work overlooks how class and\nrace structure the impacts [53]. Alok Vaid Menon broadens the\nterm, framing it within the ways in which transmisogyny targets\nall trans women and other transfeminine people, but is a part of a\nsystem of gender policing rooted in racism and anti-blackness re-\nsulting that can also affect cisgender people of color [78]. It frames\ntargets as “threats\" by sexualizing femininity as aggression [34],\nresulting in seemingly innocuous or positive phrases like “protect\nwomen\" carrying insidious, anti-trans implications as to who is\nconsidered a \"woman\", and from whom do they need “protection\"?\n[55,77]. Sports exemplify how racialization informs transmisogyny\nin the construction of who is considered a proper “girl\" [61]\nAnti-TransmasculinityandTransandrophobiaare two terms that","metadata":{"loc":{"lines":{"from":210,"to":224}}}}],["497cca03-87a3-4a25-b905-53eb947f9226",{"pageContent":"[55,77]. Sports exemplify how racialization informs transmisogyny\nin the construction of who is considered a proper “girl\" [61]\nAnti-TransmasculinityandTransandrophobiaare two terms that\nhave gained popularity in naming the particular forms of anti-trans\nsentiment that target trans men and transmasculine people. Trans-\nmasculine people are often deliberately obscured in both society at\nlarge and trans discourse [5], as if to falsely state that they do not\nexperience gender oppression in arenas that women, both cis and\ntrans, are understood to [8,41,44,63]. Transmasculine people ex-\nperience masculinity without the privilege of cis masculinity, often\nputting them in precarity with cis men [1], leaving them to navigate\nmasculinity in the context of their gender oppression [42,69]. When\nnot completely invisibilized, transmasculinity is targeted by a kind\nof violent paternalism that considers them “corrupted\" into a “trans","metadata":{"loc":{"lines":{"from":222,"to":235}}}}],["d0b36209-7f7c-46bb-b36c-8ad41f10e422",{"pageContent":"not completely invisibilized, transmasculinity is targeted by a kind\nof violent paternalism that considers them “corrupted\" into a “trans\ncult\", often by transfeminine people [64]. Anti-transmasculinity in-\ntersects with racism, particularly anti-blackness, to form Racialized\nTransmisandry, further compounding this portrayal of transmas-\nculine people as “gender traitors\" with racist ideas about men of\ncolor being “threatening\"[53]. These contradictory rhetorics are are\nutilized to divide trans people against each other and deny transmas-\nculine people the ability to name their oppression. Because violence\nis considered masculine, and being subject to it is considered femi-\nnine, articulations of transmasculine oppression are incongruous\nwith white, patriarchal gender logics [10,64]. Thus understandings\nof transmisogyny and anti-transmasculinity form a larger picture\nof anti-trans sentiment in concert with the concept ofExorsexism.","metadata":{"loc":{"lines":{"from":234,"to":247}}}}],["359076b1-cb39-4f47-8e91-ebfc23f57aa3",{"pageContent":"with white, patriarchal gender logics [10,64]. Thus understandings\nof transmisogyny and anti-transmasculinity form a larger picture\nof anti-trans sentiment in concert with the concept ofExorsexism.\nExorsexism, as coined by Tumblr user Vergess on May 5, 2016, refers\nto the idea that a person can only be exclusively male or female,\ninvalidating non-binary and intersex existence entirely [79]. The\ngender system we live under needs to sort people into two distinct\nboxes in order to maintain its heirarchy [64], and our society’s need\nto cling to the gender binary can be seen in the ways increasing\nacceptance of trans people comes conditioned on trans identities\nfitting neatly into these boxes [84]. With respect to the message’s\ntarget, we thus consider the following sub labels:Transmisogyny,\nAnti-Transmasculinity/Transandrophobia, andExorsexism.\nWhen evaluating the source of the content we are evaluating, we\nconsider three broad, overlapping categories: Trans Exclusionary","metadata":{"loc":{"lines":{"from":245,"to":259}}}}],["39905bd0-880d-472c-9ea4-09264c6e8c7e",{"pageContent":"Anti-Transmasculinity/Transandrophobia, andExorsexism.\nWhen evaluating the source of the content we are evaluating, we\nconsider three broad, overlapping categories: Trans Exclusionary\nRadical Feminists (aka TERFs), Right Wing, and Intracommunity.\nTERFs base their ideology in aspects of second wave feminism,\nwhereas Right Wing actors are based in religiously conservative\nright wing populism [7,11,25]. TERF and Right Wing approaches\nto Anti-Trans sentiment overlap in their demonization of trans\npeople as a threat, but differ in the particulars. Both Right Wing\nand TERF anti-trans sentiment espouse bio-essentialist and gender\nessentialist beliefs, and frame cis women as threatened by trans\npeople, transfeminine people especially. However, Right Wing trans-\nantagonism tends to emphasize “Traditional Family Values”, claim-\ning the existence of “natural” male and female gender roles, posing\ntrans/non-binary people as threats to the family unit, children, and","metadata":{"loc":{"lines":{"from":257,"to":271}}}}],["6000787f-415e-41b1-8465-bd8e9935f09c",{"pageContent":"ing the existence of “natural” male and female gender roles, posing\ntrans/non-binary people as threats to the family unit, children, and\nultimately the nation-state [25,64]. In contrast, TERFs bases misog-\nyny as “sex-based oppression” rooted solely in bodily anatomy\nand reproductive organs, thus naming transfeminine people as “in-\nvaders” and transmasculine people as “gender traitors”, both being\nthreats to cis women [11,25]. Analysis of Intracommunity Anti-\nTrans sentiment can draw upon any aforementioned avenues of\ntrans-antagonism, and is important in naming ways in which com-\nmunity members leverage respectability politics and privilege to\namplify harm against fellow community members[32, 70].\nPro-TransWe build our Pro-Trans taxonomy largely on approaches\nto pro-trans content we observed in our collected data while draw-\ning on taxonomies related to online misogyny [36], refined for\ntrans-related sentiment [18]. First and foremost, we do not consider","metadata":{"loc":{"lines":{"from":270,"to":284}}}}],["06d7136a-504b-40d8-9219-0c2d3f5f0538",{"pageContent":"to pro-trans content we observed in our collected data while draw-\ning on taxonomies related to online misogyny [36], refined for\ntrans-related sentiment [18]. First and foremost, we do not consider\nthe source of the content as we do for anti-trans sentiment. Given\nthat large amounts of pro-trans content is created by trans/non-\nbinary people, we want to avoid specifically identifying such users\nfor their own privacy and safety. Furthermore, even if such a deter-\nmination relied solely on explicit self-reporting within the content,\ncreators who at time of this paper identify themselves as cis may\nlater realize that they are trans themselves. Overall, any attempt\nat separating trans creators from cisgender allies is fraught and\nrisks reinforcing cis-normativity, the normative assumption that\nall people are cisgender unless confirmed otherwise [40, 73].\nWe consider three categories that pro-trans content may or may\nnot fall under:Celebration of Trans Existence,Refutation of Anti-","metadata":{"loc":{"lines":{"from":282,"to":296}}}}],["10ad0736-978a-4247-bcb0-f9180a2dec36",{"pageContent":"all people are cisgender unless confirmed otherwise [40, 73].\nWe consider three categories that pro-trans content may or may\nnot fall under:Celebration of Trans Existence,Refutation of Anti-\nTrans Rhetoric, andConnection to Broader Liberation. These cate-\ngories were constructed after observing trends in pro-trans content\non TikTok. Once again, these categories are not mutually exclusive.\nThe first of these categories,Celebration of Trans Existence, applies\nto content that ranges from creators expressing joy at aspects of\ntrans experiences, to simply identifying trans people identifying\nthemselves as such while participating in hobbies, fan spaces, and\nother parts of online life. This taps into the concept ofTrans Joy,\na concept related to Chakravathi et al’s “Hope Speech” [18]. Cel-\nebrating the joy of being trans is an effective form of resistance\nagainst transantagonism, both by fighting the stigma associated\nwith transness and by providing a vision of a joyful future for trans","metadata":{"loc":{"lines":{"from":294,"to":308}}}}],["21bcb250-29ce-4cec-a12e-fa4322c73317",{"pageContent":"against transantagonism, both by fighting the stigma associated\nwith transness and by providing a vision of a joyful future for trans\npeople [56,83]. Trans Joy is understudied in social science research\n[37,75], and including it in our taxonomy will bring into view\npro-trans action that risks being invisibilized.\nRefutation of Anti-Trans Rhetoricis a straightforward category\nreferring to content that directly engages with and refutes anti-trans\ncontent, and relates to Chakravarthi et al’s “Counter Speech” [18].\nConnection to Broader Liberationrefers to content that explicitly\nmakes a connection between transantagonism and other systems\nof oppression in hopes of building solidarity. Examples of this can\nbe seen in the connections between fat-antagonistic and trans-\nantagonistic body policing [12], related fights for bodily autonomy\nfor both gender affirming and reproductive health care [9], and the\nracism and anti-blackness that informs trans-antagonism [53,64,","metadata":{"loc":{"lines":{"from":307,"to":321}}}}],["79dffc4f-cd4c-43bd-9b20-5fe80bf473ee",{"pageContent":"antagonistic body policing [12], related fights for bodily autonomy\nfor both gender affirming and reproductive health care [9], and the\nracism and anti-blackness that informs trans-antagonism [53,64,\n78]. With this, we have established the details of our taxonomy, as\nillustrated in Figure 1.","metadata":{"loc":{"lines":{"from":319,"to":323}}}}],["fc3a756c-cf5e-4b0c-84e4-1b81f0bb3d01",{"pageContent":"Maxyn Leitner, Rebecca Dorn, Fred Morstatter, and Kristina Lerman\nAnti-TransNeutralPro-Trans\nExorsexism \nTransandrophobia \nTransmisogyny\nTERF \nRight-Wing \nIntracommunity\nIrrelevant\nCelebration of Trans Existence \nRefutation of Anti-Trans Rhetoric \nConnection to Broader Liberation\nFigure 1: Trans Sentiment Taxonomy.\n3.1  The Trans Sentiment Taxonomy\nThis taxonomy categorizes sentiment towards trans and gender\ndiverse populations, making distinctions between subgroups and\naccounting for microaggression rhetoric. We present an overview\nof our taxonomy here. At the top level of our taxonomy, we have\nthree categories: Pro-Trans, Anti-Trans, and Neutral. Each category\nhouses sub-categories.\n3.1.1  Pro-Trans.\n•Celebration of Trans Existence.Explicit celebrations of trans\nlife, and trans individuals identifying themselves while par-\nticipating in joyful aspects of life (e.g. hobbies, communi-\nties).\n•Refutation of Anti-Trans Rhetoric.Engagement with Anti-","metadata":{"loc":{"lines":{"from":325,"to":350}}}}],["45216bb2-b4e5-4cba-89a8-d6becd1f3bc9",{"pageContent":"life, and trans individuals identifying themselves while par-\nticipating in joyful aspects of life (e.g. hobbies, communi-\nties).\n•Refutation of Anti-Trans Rhetoric.Engagement with Anti-\nTrans actors or rhetoric with the purpose of showing their\nflaws and/or the harm they cause to trans/non-binary peo-\nple.\n•Connection to Broader Liberation.Content that draws paral-\nlels and connections between trans rights and other strug-\ngles for liberation, such as anti-racism, disability justice,\nreproductive freedom, and broader gender justice.\n3.1.2  Neutral.\n•Irrelevant.Content that makes no explicit or implicit refer-\nence to trans/non-binary people, and has no implications\nfor them specifically as trans/non-binary people.\n3.1.3  Anti-Trans.\n•TransmisogynyAnti-Trans sentiment rooted policing claims\nto femininity and womanhood by those who fall outside\nthe white, cisgender model of womanhood. Particularly\ntargets tranfeminine people as well as cisgender women of","metadata":{"loc":{"lines":{"from":347,"to":366}}}}],["59885b44-d64b-4dd4-8852-a2848e9fcec7",{"pageContent":"to femininity and womanhood by those who fall outside\nthe white, cisgender model of womanhood. Particularly\ntargets tranfeminine people as well as cisgender women of\ncolor, with this sentiment most sharply focused on Black\ntransfeminine people via transmisogynoir.\n•Anti-Transmasculinity/TransandrophobiaAnti-Trans senti-\nment rooted in policing claims to masculinity and manhood,\n•ExorsexismAnti-Trans sentiment rooted in the idea that\none can only be male or female, not neither, and not both.\nParticularly targets nonbinary, intersex, and altersex peo-\nple.\n•TERFAnti-Trans sentiment that comes from a Trans Ex-\nclusionary Radical Feminist source. Typically appeals to\na bioessentialist narrative of gender oppression, frames\ntransness as rooted in \"gender stereotypes\" and a threat to\nthe liberation and safety of cisgender women.\n•\nRight WingAnti-Trans sentiment that comes from a Right\nWing/Culturally Conservative Source. Typically appeals to\nAnti-TransPro-Trans","metadata":{"loc":{"lines":{"from":364,"to":383}}}}],["a144f4e6-95cf-4710-8235-2abd6a9bee7c",{"pageContent":"the liberation and safety of cisgender women.\n•\nRight WingAnti-Trans sentiment that comes from a Right\nWing/Culturally Conservative Source. Typically appeals to\nAnti-TransPro-Trans\n#nooneisborninthewrongbody#transgender\n#saveoursinglesexspaces#transrights\n#genderideology#transmen\n#whatisawoman#nonbinaryawareness\n#parentalrights#transmisogyny\n#ywnbaw#protecttranskids\n#terftok#transisbeautiful\n#savethetomboys#tdov\n#savewomenssports#tdor\n#adulthumanfemale#nonbinaryvisibility\nTable 1: Example Hashtags (seed set hashtags in bold).\n\"traditional values\" and frames transness as a threat to the\nfamily and national project.\n•IntracommunityAnti-Trans sentiment that comes from self-\nidentified members of the trans/non-binary community.\nOften appeals to respectability politics, and denigrating\nspecific subgroups of the trans/nonbinary community in\nhopes of cisgender approval.\n4  Methods\n4.1  Dataset\nWe began data collection by identifying hashtags commonly used","metadata":{"loc":{"lines":{"from":379,"to":404}}}}],["eeda1674-a33d-4e30-8c7c-93a67eb975ab",{"pageContent":"specific subgroups of the trans/nonbinary community in\nhopes of cisgender approval.\n4  Methods\n4.1  Dataset\nWe began data collection by identifying hashtags commonly used\non TikTok that were associated with both pro-trans and anti-trans\ncontent by manually surveying prominent trans users and anti-\ntrans figures on Twitter with over 1000 followers, and leveraging\none author’s domain expertise as a trans person following online\ntrans discourse. This approach yielded a seed set of hashtags. We\nleveraged TikTok’s research API [22] to gather videos that used\nthese hashtags along with their associated comments. Next, we\nconducted a snowball sample, a process wherein an initial seed set\nof subjects are asked to recommend additional subjects, repeated\nfor multiple rounds if needed to accrue subjects with similar charac-\nteristics to the seed set [35,62]. In our implementation, we collected\nall hashtags that co-occurred in the content surfaced by our initial","metadata":{"loc":{"lines":{"from":400,"to":416}}}}],["ce404995-bd2f-4a74-8a10-5d096e039585",{"pageContent":"teristics to the seed set [35,62]. In our implementation, we collected\nall hashtags that co-occurred in the content surfaced by our initial\nseed set, selected the hashtags relevant to trans/nonbinary iden-\ntity, and then performed another round of data collection from the\nTikTok Research API by identifying other hashtags that commonly\noccur in these videos. With these additional hashtags, we collected\nmore videos and comments. Some examples of the anti-trans and\npro-trans hashtags we searched over are listed in Table 1.\nMany of our anti-trans hashtags utilized euphemisms and dog\nwhistles in order to avoid content moderation. Explicit slurs den-\nigrating trans people often yield no results, as TikTok refuses to\nserve content with these words. Of particular note is that different","metadata":{"loc":{"lines":{"from":415,"to":426}}}}],["08d8cd61-ae96-4044-9163-0fdba5f1f13b",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\ngroups of trans people were targeted by particular hashtags. For\nexample, the hashtag “#ywnbaw,” an acronym for “You will never\nbe a woman,” targets trans women and other transfeminine people\nspecifically, and was associated with a large number of videos on\nthe platform. However, the hashtag “#ywnbam” (“You will never\nbe a man”) returned relatively few results, as trans men and other\ntransmasculine people were much more likely to be targeted with\nthe hashtags “#genderconfusion” and “#savethetomboys.”\nAdditionally, some of the hashtags we crawled could lead to\ncontent that is either anti-trans, or completely unrelated, depending\non the context. For example, “#groomer” could be falsely portraying\ntrans people as inherently predatory, or it could be attached to dog\ngrooming content. Thus, we attempted to filter out results that\ncontained hashtags indicating a context other than trans people.","metadata":{"loc":{"lines":{"from":428,"to":442}}}}],["5a8c8ef2-916c-4e92-877f-68242080d46f",{"pageContent":"trans people as inherently predatory, or it could be attached to dog\ngrooming content. Thus, we attempted to filter out results that\ncontained hashtags indicating a context other than trans people.\nIn total, we gathered data on 59,860 videos as a result of searching\non 41 anti-trans hashtags and 26 pro-trans hashtags. The resulting\ndata entries included the username of the creator, the video’s de-\nscription, hashtags, time of creation, like count, comments and a\nlink to the video. We then downloaded each TikTok video via the\npython library Pyktok.\n2\nPyktok is effective at downloading videos\nfrom the platform, but encounters several issues in video retrieval.\nReasonably, videos that have since been made private are not able\nto be downloaded. TikTok allows posts that are simply a photo\ncollage along with some background audio (usually music), which\nsimilarly cannot be downloaded. Finally, with some probability\nPyktok will fail to download public video content. All three of these","metadata":{"loc":{"lines":{"from":440,"to":456}}}}],["2339bf1b-205b-486e-afb5-c043c5814f30",{"pageContent":"collage along with some background audio (usually music), which\nsimilarly cannot be downloaded. Finally, with some probability\nPyktok will fail to download public video content. All three of these\nphenomena were reported in Pinto et al’s work analyzing content\non the platform [65], and in our case affected 31.7% of our collected\ndata. However, many of these samples still contained identifiable\ntrans sentiment in the collected description, so we retained them\nin our dataset.\nFor all videos that we were able to download, we proceed to gener-\nate an automated transcription of the audio in the video. We utilized\nOpenAI’s Whisper to transcribe audio for each sample [68]. For\neach of our samples, we construct a string composed of the audio\ntranscription, followed by the written description associated with\nthe TikTok, and associate it with that sample in our dataset.\nFrom here, we proceeded to parse the description of each video for","metadata":{"loc":{"lines":{"from":454,"to":468}}}}],["04833cda-d169-451f-93d1-df0d00cb804a",{"pageContent":"transcription, followed by the written description associated with\nthe TikTok, and associate it with that sample in our dataset.\nFrom here, we proceeded to parse the description of each video for\ninteraction with other accounts. On TikTok, there are 4 kinds of in-\nteractions with other accounts that can occur through the creation\nof a video: Tags, Stitches, Duets, and Replies. Tags refer to any other\naccount that is simply “tagged” in the video description through\nthe use of “@.” Multiple accounts can be tagged in the same video,\nas demonstrated in the example below:\nthe best of friends @reneerapp @dylanmulvaney\n#reneerapp #reneerappsupremacy #reneerappfan\n#dylanmulvaney #everythingtoeveryone #live\nStitches refer to content that consists of video from a creator ap-\npended to part of another creator’s video. This allows for a creator\nto make a public response to another creator’s content. Meanwhile,\nduets allow a user to create a video consisting of their own con-","metadata":{"loc":{"lines":{"from":466,"to":481}}}}],["add5aa66-4ab7-498c-b91c-86c5249132f1",{"pageContent":"to make a public response to another creator’s content. Meanwhile,\nduets allow a user to create a video consisting of their own con-\ntent alongside another user’s content, synced temporally. Finally,\nReplies allow a user to create a video specifically in response to\n2\nhttps://pypi.org/project/pyktok/\na comment on one of their previous videos. These three interac-\ntions in particular can be used to form their own respective reply\nnetworks, as well as a larger reply network containing all three\nkinds of “replies.” For each video, we stored the usernames of any\nother users who were tagged, replied to, stitched with, or dueted\nwith according to the kind of interaction. At times, TikTok would\nresolve the tagged username to a non-unique display name, which\nallows for whitespace, and so we were unable to parse the identity\nof the users tagged in this way.\n4.2  Network Patterns\nGiven that Duets and Stitches both involve reacting to another","metadata":{"loc":{"lines":{"from":480,"to":496}}}}],["4c9a3ed3-ac14-48b4-a0e3-1d782ba3fbae",{"pageContent":"allows for whitespace, and so we were unable to parse the identity\nof the users tagged in this way.\n4.2  Network Patterns\nGiven that Duets and Stitches both involve reacting to another\nuser’s video with a video of one’s own, we grouped both of these\ninteractions together and created a reply network of these inter-\nactions in our dataset. Likewise, we grouped Replies and Tagging\ntogether, as they involve reacting to either a user’s comment or\nsimply referring to them in a video description. We were able to\nvisually identify both clusters centered around known anti-trans\nactors and clear pro-trans actors. We aim to automatically identify\nusers in these networks as pro-trans, anti-trans, or neutral based\non their content, in order to assess differences in network structure\nbetween pro-trans and anti-trans communities. For this purpose,\nwe build a labeled dataset from our collected data using our taxon-\nomy of trans related sentiment outlined earlier and visualized in\nFigure 1.","metadata":{"loc":{"lines":{"from":493,"to":509}}}}],["2df126fc-0348-4406-9010-3d20e488bb98",{"pageContent":"we build a labeled dataset from our collected data using our taxon-\nomy of trans related sentiment outlined earlier and visualized in\nFigure 1.\n4.3  Annotation\nIn order to accurately and ethically label our sample data, we follow\nrecommendations in formulating our task, selecting our annota-\ntors, considering platform and infrastructure choices, as well as\nanalyzing and evaluating our data [24].\n4.3.1  Annotation Set-Up.We compile our labeled dataset by ran-\ndomly selected 100 samples from each of the following: TikToks\nthat containedonly Pro-Trans hashtags, TikToks that contained\nonly Anti-Trans hashtags, and TikToks that containedboth\nPro-Trans and Anti-Trans hashtags. This helps include as many\nsamples belonging to each of our three main labels as possible.\nTo combat the subjectivity of our task, we make available a\ncodebook containing sentences guiding how to classify content in\naccordance with our taxonomy. This helps normalize what terms","metadata":{"loc":{"lines":{"from":507,"to":523}}}}],["8ed69015-ae77-4162-a049-2dcdc941eab1",{"pageContent":"To combat the subjectivity of our task, we make available a\ncodebook containing sentences guiding how to classify content in\naccordance with our taxonomy. This helps normalize what terms\nwe are using for the purposes of this labeling, how various edge\ncases should be classified, and what our standards for pro-trans,\nanti-trans, and irrelevant content are.Example sentences in our\ncodebook are provided in our datasheet.\n4.3.2  Annotator Selection.Annotator selection impacts annotation\naccuracy, as identity and lived experience (or lack thereof ) changes\nan annotator’s ability to effectively recognize certain social stimuli\n[71]. Furthermore, experience with anti-oppression frameworks\nis important to actively label oppressive content [81]. Our anno-\ntation team consists of two members, both of which are internal\nresearchers on the project. To account for the socio-cultural back-\ngrounds and lived experiences of our annotators, annotators are","metadata":{"loc":{"lines":{"from":521,"to":535}}}}],["2953629e-ced4-475f-a356-97d197f77680",{"pageContent":"tation team consists of two members, both of which are internal\nresearchers on the project. To account for the socio-cultural back-\ngrounds and lived experiences of our annotators, annotators are\nmembers of the trans/non-binary community with experience in\ntrans activism and frameworks for recognizing and countering","metadata":{"loc":{"lines":{"from":533,"to":537}}}}],["fa064636-036b-40f3-872e-26b46e2233b6",{"pageContent":"Maxyn Leitner, Rebecca Dorn, Fred Morstatter, and Kristina Lerman\nVanilla Input\nx\nRetrieval Database\nAnnotated \nExamples\nTaxonomy \nDefinitions\n✓ \nRelevant\nIDXVALUE\ni\nExample\ni\n Description & Transcription\nLabel: “Anti-Trans” ➡ “Exorsexism”\n...\nk\nExorsexism: Anti-Trans sentiment \nrooted in the idea that one can only \nbe male or female, not neither, and \nnot both. Particularly targets \nnonbinary, intersex, and altersex \npeople.\nIs the following text, \nconsisting of a TikTok \nvideo transcription as well \nas the associated video \ndescription, pro-\ntransgender, anti-\ntransgender, or neutral?\nDescription: .... \nTranscript: ...\nContext-Enhanced Input\nTask\nInstance\nIs the following text, consisting of \na TikTok video transcription as \nwell as the associated video \ndescription, pro-transgender, \nanti-transgender, or neutral?\nTask\nInstance\nConsider the example...\nExorsexism is defined as ...\nRelevant Context\nDescription: .... \nTranscript: ...\n✓ \nRelevant\nTask \nPrompts\nTranscript \nModel\nLabel","metadata":{"loc":{"lines":{"from":539,"to":593}}}}],["34bf2b7b-d185-4e46-a184-5b975b28fb37",{"pageContent":"anti-transgender, or neutral?\nTask\nInstance\nConsider the example...\nExorsexism is defined as ...\nRelevant Context\nDescription: .... \nTranscript: ...\n✓ \nRelevant\nTask \nPrompts\nTranscript \nModel\nLabel\nPro-Trans\nOutput\nLLaMA3\nFigure 2: Pipeline detailing utilization of RAG (Retrieval Augmented Generation). Before the model is prompted, relevant\nannotated examples and taxonomy concepts are retrieved and added to the prompt. Enhancing the model with relevant\nexamples and concepts leads to improved accuracy in pro-trans classification, lower false negatives in anti-trans classification,\nand improved accuracy overall.\nanti-trans action. Our datasheet further discusses handling of an-\nnotation ethics, including how the people most effective at labeling\nanti-trans content will be those most affected by exposure to it.\nFrom here, we proceeded with the annotation of our 300 selected\nsamples according to our taxonomy and codebook with our anno-","metadata":{"loc":{"lines":{"from":579,"to":605}}}}],["18741a2d-b30d-4774-8cf5-c4538eea3d8c",{"pageContent":"anti-trans content will be those most affected by exposure to it.\nFrom here, we proceeded with the annotation of our 300 selected\nsamples according to our taxonomy and codebook with our anno-\ntation team. One annotator labeled all 300 samples, while the other\nlabeled a subset of 50 samples for validation. Annotators yielded\nfairly high annotator agreement on this subset (Cohen Kappa 0.64),\nparticularly for such a subjective task.\n4.4  Classification via LLM\nWe build a trans sentiment classification model for TikTok, and\nexperiment with improving performance by integrating our taxon-\nomy with RAG (Retrieval Augmented Generation). We use LLaMA\n3 as a base model, as it builds upon its previous iteration which has\nextensive reporting of safety protocols and training data specifi-\ncally containing terms explicitly relating to gender and transgender\nidentity in particular [26].\nProcessing raw videos is incredibly costly and difficult. Instead,","metadata":{"loc":{"lines":{"from":603,"to":618}}}}],["c5ca453a-3847-4dbc-8351-b16799d242f4",{"pageContent":"cally containing terms explicitly relating to gender and transgender\nidentity in particular [26].\nProcessing raw videos is incredibly costly and difficult. Instead,\nmodel input includes an audio transcription from the Whisper API,\n3\nallowing a text representation of the audio. The Whisper API\nis a well-established tool for automated speech recognition, with\ndemonstrated robustness across various domains and accents [68].\nGiven the extent of its training data, we expect it to contain less\nbias than other transcription tools. To further mitigate bias, given\npotential bias in speech recognition [43], we add the user’s written\nvideo description.\n4.4.1  LLaMA3.We began by taking a zero shot approach, tasking\nthe LLM with classifying each of our annotated examples simply\nusing the pre-trained LLaMA 3 model. We constructed 8 prompts\ntasking LLaMA 3 [28] with labeling the constructed text sample as\neither anti-trans, pro-trans, or neutral. For each sample, we tried","metadata":{"loc":{"lines":{"from":616,"to":632}}}}],["72eae99c-1da3-4430-a876-c85b80bc444d",{"pageContent":"using the pre-trained LLaMA 3 model. We constructed 8 prompts\ntasking LLaMA 3 [28] with labeling the constructed text sample as\neither anti-trans, pro-trans, or neutral. For each sample, we tried\nzero shot classification with each of the 8 prompts, then ensembled\nthe results. We compared the ensembled labels to the ground truth\nlabels for each sample, evaluating the model’s recall, precision, F1,\nalong with constructing a confusion matrix of the three classes We\n3\nhttps://openai.com/index/whisper/\nalso kept track of which prompt performed the best over all samples,\nand it was that prompt we used for the following approaches.\n4.4.2  LLaMA3+RAG Examples.In order to combat LLM halluci-\nnation and LLM difficulty to reason with out-of-text context, we\nsupplement our zero-shot approach using the fine-tuning method\nRetrieval Augmented Generation (RAG)[33]. RAG links an LLM\ninput with an external database using an indexing procedure, in","metadata":{"loc":{"lines":{"from":630,"to":645}}}}],["b256e3a8-36cf-46e0-af7c-2b5185a34f2a",{"pageContent":"supplement our zero-shot approach using the fine-tuning method\nRetrieval Augmented Generation (RAG)[33]. RAG links an LLM\ninput with an external database using an indexing procedure, in\nwhich the RAG system indexes the external database files by break-\ning them into smaller chunks, creating vector representations of\nthese chunks for retrieval. Data is then retrieved by computed rele-\nvancy to the text input in our case the transcription, description,\nand classification prompt, and provided to the LLM as additional\ncontext. We utilize LlamaIndex as our RAG system, for its compati-\nbility with the LLaMA 3 engine as well as overall performance [86].\nIn LLaMA3+RAG Examples, we index annotated examples into two\nprimary buckets: Anti-Trans and Pro-Trans. Examples are matched\nto inputs based on the cosine similarity of their representations,\nand anywhere from 0 to 3 examples can be matched.\n4.4.3  LLaMA3+RAG Examples+RAG Taxonomy.We evaluate the","metadata":{"loc":{"lines":{"from":643,"to":657}}}}],["c236bcd1-c007-436e-bce2-63cb54471841",{"pageContent":"to inputs based on the cosine similarity of their representations,\nand anywhere from 0 to 3 examples can be matched.\n4.4.3  LLaMA3+RAG Examples+RAG Taxonomy.We evaluate the\nefficacy of our taxonomy by bolstering the RAG system with our\ncodebook. The taxonomy is processed such that each definition is\nseparately indexed, and appended to the RAG Examples database. In\nthis configuration, our RAG system is supplied with both example\ninputs and guiding principles to classify content samples.\n5  Results\n5.1  Classification Results\n5.1.1  LLaMA3.The zero shot approach in Figure 3 exhibits lowest\nperformance when distinguishing between Pro-Trans content and\nNeutral content.\nIn Table 2, we see an overall lean towards Neutral classification\nin the zero-shot approach, with a high false positive rate for that\ncategory (precision=0.37, recall=0.74). The inverse is true for Pro-\nTrans content with a high false negative rate (precision=0.86, recall","metadata":{"loc":{"lines":{"from":655,"to":671}}}}],["6978566e-83a0-45bc-a2bd-f98dc66b9ce6",{"pageContent":"category (precision=0.37, recall=0.74). The inverse is true for Pro-\nTrans content with a high false negative rate (precision=0.86, recall\n=0.28). The zero-shot approach performs reasonably at classifying\nAnti-Trans content, with precision>0.4and recall>0.6for an F1","metadata":{"loc":{"lines":{"from":670,"to":673}}}}],["dd047818-3129-4ba3-ab25-6ed0162ed363",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\nANTIPRONEUTRAL\nPredicted Label\nANTI\nPRO\nNEU\n0.110.030.04\n0.060.140.32\n0.080.000.22\nLLaMA3\nANTIPRONEUTRAL\nPredicted Label\nANTI\nPRO\nNEU\n0.100.040.04\n0.070.310.15\n0.080.010.20\nLLaMA3 + Examples\nANTIPRONEUTRAL\nPredicted Label\nANTI\nPRO\nNEU\n0.120.040.02\n0.060.400.07\n0.140.010.15\nLLaMA3 + Examples + Taxonomy\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\n0.40\nFigure 3: Classifier Confusion Matrices\nscore>0.5. When we examine recall by sublabel in Table 2, more de-\ntails emerge. While this model struggles to recall Pro-Trans content\nin general, the effect is most pronounced withCelebration of Trans\nExistencecontent (CEL). For Anti-Trans content, this model has low\nrecall on transmisogynistic (TM), anti-transmasculine (ATM), and\nintracommunity (INTRA) content.\n5.1.2  LLaMA3+RAG Examples.The addition of the RAG system\npopulated with sample data led to an increased ability to differenti-","metadata":{"loc":{"lines":{"from":675,"to":719}}}}],["f4cba50c-0f26-4402-9f2a-1d82f9651501",{"pageContent":"intracommunity (INTRA) content.\n5.1.2  LLaMA3+RAG Examples.The addition of the RAG system\npopulated with sample data led to an increased ability to differenti-\nate Pro-Trans Content from Neutral Content, as seen in Figure 3\nas well as the increased precision and F1 scores for both Pro-Trans\nand Neutral Categories in Table 2. Neutral false positive rate and\nPro-Trans false negative rate have both been significantly reduced,\nwithout significant increases in Neutral false positive or Pro-Trans\nfalse negative rate. Anti-Trans classification experiences a slight\ndownturn in precision and recall, and thus also F1 score. Analyzing\nby sublabel, we see significant gains in recall for all Pro-Trans sub-\nlabels for this model in Table 2. Meanwhile, recall for Anti-Trans\ncontent has decreased for al sublabels except forIntracommunity\n(INTRA) andTransmisogyny(TM).\n5.1.3  LLaMA3+RAG Examples+RAG Taxonomy.With the addition\nof the codebook to our RAG system, we see even further improve-","metadata":{"loc":{"lines":{"from":717,"to":732}}}}],["9064414c-6148-4ef0-9413-b0177739a136",{"pageContent":"(INTRA) andTransmisogyny(TM).\n5.1.3  LLaMA3+RAG Examples+RAG Taxonomy.With the addition\nof the codebook to our RAG system, we see even further improve-\nments leading to this model having the highest overall accuracy.\nThis system excels at identifying Pro-Trans content, with the high-\nest precision, recall, and thus F1 score out of all the models for this\ncategory. In particular, Pro-Trans recall has almost tripled from the\nzero shot approach. This model also has the highest precision for\nNeutral content, though coming at the cost of the lowest recall for\nthis category. In terms of Anti-Trans Performance, this model has\nthe highest recall, but the lowest precision. Ultimately, this model is\nmuch more likely to label content as either Pro-Trans or Anti-Trans\nas opposed to Neutral. We see in Table 2 that this model has the\nhighest recall for all Pro-Trans and Anti-Trans sublabels.\n5.2  Network Results\nWe gathered the largest connected component in both the tag/reply","metadata":{"loc":{"lines":{"from":730,"to":745}}}}],["144975b6-199d-4cca-9ddd-fd7abdab643e",{"pageContent":"highest recall for all Pro-Trans and Anti-Trans sublabels.\n5.2  Network Results\nWe gathered the largest connected component in both the tag/reply\n& duet/stitch reply graphs, and ran our LLaMA3 + RAG Examples\n+ RAG Taxonomy classifier on all samples wherein. Looking at\nthe resulting labeled networks in Figure 4, we see mostly neutral\nand anti-trans users, with small pockets of pro-trans users. Anti-\ntrans users outnumber pro-trans users about 5 to 1 in tags/replies,\nand 2.5 to 1 in duets/stitches. Assortativity was incredibly low,\nespecially for replies (duet=−0.51, reply=−0.79, tagged=−0.49,\nstitch=−0.53). When neutral nodes are ignored, this measure is even\nlower (duet=−0.64, reply=−0.93, tagged=−0.62, stitch=−0.92).\n6  Discussion\n6.1  Classification\nThe baseline version of LLaMA3 was much more likely to label\ncontent as Neutral than either Pro-Trans or Anti-Trans, potentially\nexemplifying cis-normativity and how it both sensationalizes and","metadata":{"loc":{"lines":{"from":743,"to":759}}}}],["7f43346c-aa53-4be9-be03-9846e6cf60c7",{"pageContent":"The baseline version of LLaMA3 was much more likely to label\ncontent as Neutral than either Pro-Trans or Anti-Trans, potentially\nexemplifying cis-normativity and how it both sensationalizes and\ninvisibilizes trans existence [40,73]. Looking at the particulars,\nLLaMA3’s struggle to recognizeCelebration of Trans Existencevia\nlow recall (.38) demonstrates a common research finding where\nLLMs struggle with understanding gender-queer in-group language\n[26]. The off-the-shelf model also fails to find Anti-Trans content\ninvokingAnti-Transmasculinity(.53) andTransmisogyny(.54). This\nsquares with the ways in which obscuring how transmasculine\npeople are specifically targeted is incentivized in our society [64]\nand how LLM’s can struggle to recognize the transmisogyny often\nimplied by anti-transmasculine or exorsexist content, or the trans-\nmisogyny inherent to racist degendering of cis women of color\n[38,53,64]. The differences in recall forTERFandRight Wingcon-","metadata":{"loc":{"lines":{"from":757,"to":771}}}}],["812979fd-892f-45a4-b460-655d25d641a6",{"pageContent":"implied by anti-transmasculine or exorsexist content, or the trans-\nmisogyny inherent to racist degendering of cis women of color\n[38,53,64]. The differences in recall forTERFandRight Wingcon-\ntent indicate furtive research directions into what features are most\nprominent in these LLM’s model of trans-antagonistic actors.\nTheLLamA3 + RAG Samplesmodel vastly improved precision\non Neutral content and performance overall on all content– only\non subclasses underrepresented in the instances (proportion≤.07)\ndoes recall decrease. However, the performance ofLLaMA3 + RAG\nSamples + RAG Taxonomyyields a meteoric rise in recall for the\nCelebration of Trans Existenceas well as all Anti-Trans sublabels.\nThe improvements yielded by even providing a few samples as con-\ntext to the classification task points to how strategies for visibility\nutilized by trans/non-binary creators may result in samples of their\ncontent being more informative to our model [29,48]. Additionally,","metadata":{"loc":{"lines":{"from":769,"to":783}}}}],["612586ca-3756-4ba3-a725-15a303caaef8",{"pageContent":"Maxyn Leitner, Rebecca Dorn, Fred Morstatter, and Kristina Lerman\nTable 2: Classification Performance Metrics and Recall by Sublabel\nAnti-Trans (n=52)Pro-Trans (n=160)Neutral (n=88)\nModelPRF1PRF1PRF1Accuracy\nLLaMA30.430.620.510.860.280.420.370.740.490.47\nLLaMA3+RAG Samples0.390.580.470.880.580.700.510.680.580.61\nLLaMA3+RAG Samples+RAG Taxonomy0.370.670.480.91  0.76  0.83  0.620.510.560.67\nAnti-Trans (n=52)Pro-Trans (n=160)\nModelTMATMXORTERFRWINTRACELREFCON\nLLaMA30.540.530.60   0.800.650.500.380.440.57\nLLaMA3+RAG Samples0.610.410.400.600.591.000.610.670.71\nLLaMA3+RAG Samples+RAG Taxonomy0.68  0.65   0.60   0.80   0.71   1.00   0.80  0.72  0.71\nProportion of Sample0.120.070.020.020.150.010.420.160.03\n(a) Tag/Reply Network(b) Duet/Stitch Network\nFigure 4: Labeled Networks (anti-trans nodes/edges in red, pro-trans in green, neutral in black\nour codebook in concert with the provided samples being such\neffective context in identifying Pro-Trans content points to it being","metadata":{"loc":{"lines":{"from":785,"to":801}}}}],["e31fa3b6-a2af-41a2-acb3-f5479121ef1c",{"pageContent":"our codebook in concert with the provided samples being such\neffective context in identifying Pro-Trans content points to it being\nfairly easily distinguishable from Neutral and Anti-Trans content\nwhen characterizing such content accurately is prioritized. The\nmeteoric rise in recall for theCelebration of Trans Existencesublabel\ncompared to the base model indicates a schism in perspective be-\ntween trans/nonbinary community domain experts and the LLM’s\ngeneral training data. In queer community, “Our existence is resis-\ntance” is a resonant slogan, as being openly ourselves defies societal\nnorms [52]. Incorporating our taxonomy more accurately reflects\nthat reality. Further, the improved recall for subgroup sublabels\nmay indicate that our codebook is ameliorating potential biases in\nour RAG Sample system, and doing so in a way that is much more\neffective in recallingRight Wingcontent.\nAdmittedly, this comes at the cost of a larger false positive rate","metadata":{"loc":{"lines":{"from":800,"to":814}}}}],["625397f6-84a7-4df6-a303-ee21483a08e5",{"pageContent":"our RAG Sample system, and doing so in a way that is much more\neffective in recallingRight Wingcontent.\nAdmittedly, this comes at the cost of a larger false positive rate\nof Anti-Trans classification, namely leading to more Neutral con-\ntent being flagged as Anti-Trans. It is possible that our model is\nstruggling when particular phrases are used in both trans related\nand irrelevant context (i.e. “#protectthechildren” being used both\nas an anti-trans dog whistle and as a way to organize against child\nsexual assault). Another possibility lies in the accuracy of our an-\nnotations, as even with domain experts given a codebook to guide\ntheir annotation, trans/nonbinary people can still experience a\n“double consciousness” in navigating this task while aware of how\ncisgender peers are viewing them [27,80]. This points to a need for\nfurther research in delineating Anti-Trans from Neutral content.\n6.2  Network\nIt is clear from Figure 4 that anti-trans actors are not only prevalent","metadata":{"loc":{"lines":{"from":812,"to":827}}}}],["a2d863f3-b8d8-45e0-9062-13951b02f01a",{"pageContent":"further research in delineating Anti-Trans from Neutral content.\n6.2  Network\nIt is clear from Figure 4 that anti-trans actors are not only prevalent\non the platform, but deeply embedded with “neutral\" users. This\ncombined with the low assortativity scores, along with visual in-\nspection of the graphs, shows anti-trans actors attacking pro-trans\nusers more often that engaging amongst themselves. Pro-trans\nusers conversely tended to be either very isolated or found in tight\nknit clusters, possibly as a defense tactic.\n7  Limitations & Future Work\nPositionality Statement.Two of the authors of this work are\nnonbinary, with one of them being transfeminine. The remaining\nauthors are cisgender.\nDatasheet.We host the datasheet for our dataset online\n4\n. Infor-\nmation found there includes ethical considerations in the current\nand planned future selection and hiring of data annotators, along\nwith our complete set of searched hashtags and our codebook.","metadata":{"loc":{"lines":{"from":825,"to":843}}}}],["cc70e863-1ae1-40fc-98d6-876c53c1955e",{"pageContent":"mation found there includes ethical considerations in the current\nand planned future selection and hiring of data annotators, along\nwith our complete set of searched hashtags and our codebook.\nFinite Taxonomy.As much as we’ve aimed to ground our taxon-\nomy in queer and transfeminist theory, our classification system\n4\nhttps://github.com/maxynrl/TransTikTokDatasheet","metadata":{"loc":{"lines":{"from":841,"to":847}}}}],["0431ba65-3ab6-47ba-a897-c86b618ca7da",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\nstill fails to capture important nuances in trans/non-binary experi-\nence. We look forward to challenging, refining, and extending this\ntaxonomy as we continue to pursue this research topic.\nAnnotator Choice.Moving forward, we aim to hire more data\nannotators in accordance with the ethical standards outlines in our\ndatasheet, particularly trans people of color with varying experi-\nences of transness. As we do this, it is likely that we will discover\nbiases and limitations in what our current annotations were able\nto accurately capture about the TikTok data collected.\nTrans Scholarship.As we engage with trans and queer studies,\nwe find that whiteness guides what finds prominence in these fields,\ninherently making these fields of study racist [30].\nSpeech-to-Text Model.In future work, we’d like to see how results\nshift if we try different speech-to-text models for our automated","metadata":{"loc":{"lines":{"from":849,"to":863}}}}],["4a22440d-a1a5-4570-81ce-e8770a8a7fa6",{"pageContent":"inherently making these fields of study racist [30].\nSpeech-to-Text Model.In future work, we’d like to see how results\nshift if we try different speech-to-text models for our automated\ntranscription. In particular, we suspect we might see improved\nclassification performance if we utilize a transcription model that\nis capable of recognizing when the speaker has changed, so as to\nbetter understand the spoken content of stitches and duets.\nClassification.We would like to further refine the accuracy of\nour classifier in future works, as well as introduce classifiers for all\nsublabels in our taxonomy. We also plan to explore whether adding\nmore information, such as comments or local network structure, to\nour inputs will enable more robust classification.\nNetwork Analysis.Finally, we hope to perform more in-depth\nnetwork analysis in future works. Particularly, we want to assess\nhow the network patterns we observed here play out with respect","metadata":{"loc":{"lines":{"from":861,"to":875}}}}],["4d57ac5e-8f4e-417e-aced-c5fd9ef4d069",{"pageContent":"Network Analysis.Finally, we hope to perform more in-depth\nnetwork analysis in future works. Particularly, we want to assess\nhow the network patterns we observed here play out with respect\nto different sublabels of Pro-Trans and Anti-Trans sentiment. Ulti-\nmately, we aim to characterize the temporal patterns of network\nstructure characteristics between Anti-Trans and Pro-Trans actors\nand communities.\nReferences\n[1]Miriam J Abelson. 2014.  Dangerous privilege: Trans men, masculinities, and\nchanging perceptions of safety. InSociological Forum, Vol. 29. Wiley Online\nLibrary, 549–570.\n[2]Dana T Ahern. 2024. Teaching transgender studies: Experiential knowledge and\nrace. InFeminists Talk Whiteness. Routledge, 276–287.\n[3]Daniele Albertazzi and Donatella Bonansinga. 2024. Beyond anger: the populist\nradical right on TikTok.Journal of Contemporary European Studies32, 3 (July\n2024), 673–689.   https://doi.org/10.1080/14782804.2022.2163380","metadata":{"loc":{"lines":{"from":873,"to":888}}}}],["c727b346-677b-4894-b729-f507574595ac",{"pageContent":"radical right on TikTok.Journal of Contemporary European Studies32, 3 (July\n2024), 673–689.   https://doi.org/10.1080/14782804.2022.2163380\n[4]Zoë Aldridge, Hilary McDermott, Nat Thorne, Jon Arcelus, and Gemma L. Wit-\ncomb. 2024. Social Media Creations of Community and Gender Minority Stress\nin Transgender and Gender-Diverse Adults.Social Sciences13, 9 (Sept. 2024),\n483.   https://doi.org/10.3390/socsci13090483\n[5]Amelio Robles Ávila. 2023. LGBTQ History Month Week 1: Transmasculinity\n(Invisibility & Illumination). https://lgbtqhistory.org/lgbtq-history-month-week-\n1-transmasculinity-invisibility-illumination/.  Accessed: 2024-11-27.\n[6]Trina Banerjee and K Jayasankara Reddy. 2024.   “Trans”-Ness and Shaming:\nA Thematic Analysis of Shame Among South Asian Transmen/Transmasc. In\nShame and Gender in Transcultural Contexts: Resourceful Investigations. Springer,\n211–234.\n[7]\nSerena Bassi and Greta LaFleur. 2022.   Introduction: TERFs, gender-critical","metadata":{"loc":{"lines":{"from":887,"to":901}}}}],["631524af-8dc2-483e-8c4c-728020bb12da",{"pageContent":"Shame and Gender in Transcultural Contexts: Resourceful Investigations. Springer,\n211–234.\n[7]\nSerena Bassi and Greta LaFleur. 2022.   Introduction: TERFs, gender-critical\nmovements, and postfascist feminisms. , 311–333 pages.\n[8]Greta R. Bauer, Rebecca Hammond, Robb Travers, Matthias Kaay, Karin M.\nHohenadel, and Michelle Boyce. 2009. “I Don’t Think This Is Theoretical; This Is\nOur Lives”: How Erasure Impacts Health Care for Transgender People.Journal\nof the Association of Nurses in AIDS Care20, 5 (Sept. 2009), 348–361.    https:\n//doi.org/10.1016/j.jana.2009.07.004\n[9]Elizabeth Beck, Kristie Seelman, Moon Charania, Susan M Snyder, and Sophie\nSaffan. 2024. Reproductive Justice, Bodily Autonomy, and State Violence.Affilia\n(2024), 08861099231225226.\n[10]edxi betts, NZ Suékama, and Ren-yo Hwang. 2024. Black Transfeminist Anar-\nchism.TSQ11, 1 (2024), 34–65.\n[11]Thomas J Billard. 2023. “Gender-Critical” Discourse as Disinformation: Unpack-","metadata":{"loc":{"lines":{"from":898,"to":913}}}}],["47764e89-01b1-49db-a077-b4f02e4d99eb",{"pageContent":"[10]edxi betts, NZ Suékama, and Ren-yo Hwang. 2024. Black Transfeminist Anar-\nchism.TSQ11, 1 (2024), 34–65.\n[11]Thomas J Billard. 2023. “Gender-Critical” Discourse as Disinformation: Unpack-\ning TERF Strategies of Political Communication.Women’s Studies in Communica-\ntion46, 2 (April 2023), 235–243.   https://doi.org/10.1080/07491409.2023.2193545\n[12]Kristin Binder. 2023.Body Normativity and the Hyper(in)visibility of Abject\nBodies: Living with Oppression in the Body Liberation Movement. Master’s thesis.\nUniversity of Gothenburg.  https://gupea.ub.gu.se/handle/2077/75972 Available\nonline: https://gupea.ub.gu.se/handle/2077/75972.\n[13]Caroline Blyth and Prior McRae. 2018.   “Death by a Thousand Paper Cuts”:\nTransphobia, Symbolic Violence, and Conservative Christian Discourse.   In\nRape Culture, Gender Violence, and Religion, Caroline Blyth, Emily Colgan, and\nKatie B. Edwards (Eds.). Springer International Publishing, Cham, 111–133.  https:\n//doi.org/10.1007/978-3-319-72224-5_7","metadata":{"loc":{"lines":{"from":911,"to":924}}}}],["ce4abe66-c468-4faa-9050-2a9ea7b773e4",{"pageContent":"Rape Culture, Gender Violence, and Religion, Caroline Blyth, Emily Colgan, and\nKatie B. Edwards (Eds.). Springer International Publishing, Cham, 111–133.  https:\n//doi.org/10.1007/978-3-319-72224-5_7\n[14]Vincent Boucher. 2022.Down the TikTok rabbit hole: Testing the TikTok algorithm’s\ncontribution to right wing extremist radicalization.   Master’s thesis. Queen’s\nUniversity (Canada).\n[15]\nJustin Buss, Hayden Le, and Oliver L Haimson. 2022.   Transgender identity\nmanagement across social media platforms.Media, Culture & Society44, 1 (Jan.\n2022), 22–38.   https://doi.org/10.1177/01634437211027106\n[16]Will Carless. 2023. When Libs of TikTok Tweets, Threats Increasingly Follow.\nYahoo News(2023).  https://www.yahoo.com/news/libs-tiktok-tweets-threats-\nincreasingly-101232692.html Accessed: 2024-12-04.\n[17]Bharathi Raja Chakravarthi, Bharathi Raja Chakravarthi, Adeep Hande, Adeep\nHande, Rahul Ponnusamy, Rahul Ponnusamy, Prasanna Kumar Kumaresan,","metadata":{"loc":{"lines":{"from":922,"to":936}}}}],["a8eb6d27-4f33-462d-b92d-ad2346512796",{"pageContent":"increasingly-101232692.html Accessed: 2024-12-04.\n[17]Bharathi Raja Chakravarthi, Bharathi Raja Chakravarthi, Adeep Hande, Adeep\nHande, Rahul Ponnusamy, Rahul Ponnusamy, Prasanna Kumar Kumaresan,\nPrasanna Kumar Kumaresan, Ruba Priyadharshini, and Ruba Priyadharshini.\n2022.   How can we detect Homophobia and Transphobia? Experiments in a\nmultilingual code-mixed setting for social media governance.International\njournal of information management data insights2,  2  (Nov.  2022),  100119–\n100119.  https://doi.org/10.1016/j.jjimei.2022.100119 MAG ID: 4296060110 S2ID:\n27bb9d14491975cba5413a04344647607bc76dc4.\n[18]\nBharathi   Raja   Chakravarthi,   Ruba   Priyadharshini,   Rahul   Ponnusamy,\nPrasanna   Kumar   Kumaresan,   Kayalvizhi   Sampath,   Durairaj   Thenmozhi,\nSathiyaraj Thangasamy, Rajendran Nallathambi, and John Phillip McCrae. 2021.\nDataset for Identification of Homophobia and Transophobia in Multilingual","metadata":{"loc":{"lines":{"from":934,"to":947}}}}],["baf13f78-1998-41df-bd5d-7153dc5a8ce5",{"pageContent":"Sathiyaraj Thangasamy, Rajendran Nallathambi, and John Phillip McCrae. 2021.\nDataset for Identification of Homophobia and Transophobia in Multilingual\nYouTube Comments.  arXiv:2109.00227 [cs.CL]  https://arxiv.org/abs/2109.00227\n[19]Paul S Chan. 2019. Invisible gender in medical research.Circulation: Cardiovas-\ncular Quality and Outcomes12, 4 (2019), e005694.\n[20]\nTiffany K. Chang and Y. Barry Chung. 2015.  Transgender Microaggressions:\nComplexity of the Heterogeneity of Transgender Identities.Journal of LGBT\nIssues in Counseling9, 3 (2015), 217–234.  https://doi.org/10.1080/15538605.2015.\n1068146 arXiv:https://doi.org/10.1080/15538605.2015.1068146\n[21]Claudiu Gabriel Ionescu and Monica Licu. 2023. Are TikTok Algorithms Influ-\nencing Users’ Self-Perceived Identities and Personal Values? A Mini Review. 12,\n8 (Aug. 2023), 465–465.  https://doi.org/10.3390/socsci12080465\n[22]\nFrancesco Corso, Francesco Pierri, and Gianmarco De Francisci Morales. 2024.","metadata":{"loc":{"lines":{"from":946,"to":960}}}}],["e527c977-7f23-4776-95a7-fcf22e5aaf9d",{"pageContent":"8 (Aug. 2023), 465–465.  https://doi.org/10.3390/socsci12080465\n[22]\nFrancesco Corso, Francesco Pierri, and Gianmarco De Francisci Morales. 2024.\nWhat we can learn from TikTok through its Research API. InCompanion Publi-\ncation of the 16th ACM Web Science Conference. 110–114.\n[23]\nSydney Dawson. 2024. You can’t say that on TikTok: cxnsxrshxp, algorithmic\n(in)visibility, and the threat of representation. (2024).  https://doi.org/10.14288/1.\n0443761 Publisher: University of British Columbia Version Number: 1.\n[24]   Remi Denton, Mark Díaz, Ian Kivlichan, Vinodkumar Prabhakaran, and Rachel\nRosen. 2021. Whose Ground Truth? Accounting for Individual and Collective\nIdentities Underlying Dataset Annotation.  (2021).    https://doi.org/10.48550/\nARXIV.2112.04554 Version Number: 1.\n[25]\nBriar Dickey. 2023. Transphobic Truth Markets: Comparing Trans-hostile Dis-\ncourses in British Trans-exclusionary Radical Feminist and US Right-wing Move-","metadata":{"loc":{"lines":{"from":958,"to":973}}}}],["c5b04f18-19bd-44c2-a947-b6fc2badbf42",{"pageContent":"ARXIV.2112.04554 Version Number: 1.\n[25]\nBriar Dickey. 2023. Transphobic Truth Markets: Comparing Trans-hostile Dis-\ncourses in British Trans-exclusionary Radical Feminist and US Right-wing Move-\nments.DiGeSt-Journal of Diversity and Gender Studies10, 2 (2023).\n[26]Rebecca Dorn, Lee Kezar, Fred Morstatter, and Kristina Lerman. 2024. Harmful\nSpeech Detection by Language Models Exhibits Gender-Queer Dialect Bias.\nhttp://arxiv.org/abs/2406.00020 arXiv:2406.00020 [cs].\n[27]WEB Du Bois. 2006.Double-consciousness and the veil. Vol. 203.  Rowman &\nLittlefield Publishers.\n[28]Abhimanyu Dubey, Abhinav Jauhri, Abhinav Pandey, Abhishek Kadian, Ahmad\nAl-Dahle, Aiesha Letman, Akhil Mathur, Alan Schelten, Amy Yang, Angela Fan,\net al. 2024. The llama 3 herd of models.arXiv preprint arXiv:2407.21783(2024).\n[29]Ellen Simpson, Ellen Simpson, Bryan Semaan, and Bryan Semaan. 2021.  For\nYou, or For\"You\"?: Everyday LGBTQ+ Encounters with TikTok. 4 (2021), 1–34.","metadata":{"loc":{"lines":{"from":970,"to":984}}}}],["b0eae78a-0f0c-4a81-90be-89eead51c950",{"pageContent":"[29]Ellen Simpson, Ellen Simpson, Bryan Semaan, and Bryan Semaan. 2021.  For\nYou, or For\"You\"?: Everyday LGBTQ+ Encounters with TikTok. 4 (2021), 1–34.\nhttps://doi.org/10.1145/3432951 MAG ID: 3119733760.\n[30]\nTreva Ellison, Kai M Green, Matt Richardson, and C Riley Snorton. 2017. We got\nissues: Toward a Black trans*/studies.Transgender Studies Quarterly4, 2 (2017),\n162–169.\n[31]\nA Finn Enke. 2012. The education of little cis.Transfeminist perspectives in and\nbeyond transgender or gender studies(2012), 60–77.\n[32]Matt Finley. 2020. Respectability politics and the rights of queer and transgender\npeople: Critiquing an obsolete system in the 21st century.Politicus Journal(2020),\n29–43.","metadata":{"loc":{"lines":{"from":983,"to":995}}}}],["0f70a8b2-315e-4eeb-a93e-92b4635f6f02",{"pageContent":"Maxyn Leitner, Rebecca Dorn, Fred Morstatter, and Kristina Lerman\n[33]Yunfan  Gao,  Yun  Xiong,  Xinyu  Gao,  Kangxiang  Jia,  Jinliu  Pan,  Yuxi  Bi,  Yi\nDai, Jiawei Sun, Meng Wang, and Haofen Wang. 2024.  Retrieval-Augmented\nGeneration for Large Language Models: A Survey.   arXiv:2312.10997 [cs.CL]\nhttps://arxiv.org/abs/2312.10997\n[34]Jules Gill-Peterson. 2024.A short history of trans misogyny. Verso, London ; New\nYork.\n[35]\nLeo A. Goodman. 1961. Snowball Sampling.The Annals of Mathematical Statistics\n32, 1 (1961), 148–170.   http://www.jstor.org/stable/2237615\n[36]\nElla Guest, Bertie Vidgen, Alexandros Mittos, Nishanth Sastry, Gareth Tyson,\nand Helen Margetts. 2021.  An expert annotated dataset for the detection of\nonline misogyny. InProceedings of the 16th conference of the European chapter of\nthe association for computational linguistics: main volume. 1336–1350.\n[37]\nBrendon T. Holloway. 2023.  Highlighting Trans Joy: A Call to Practitioners,","metadata":{"loc":{"lines":{"from":997,"to":1013}}}}],["1c9e5c10-cf7a-4b6a-9251-623dd04e50d4",{"pageContent":"the association for computational linguistics: main volume. 1336–1350.\n[37]\nBrendon T. Holloway. 2023.  Highlighting Trans Joy: A Call to Practitioners,\nResearchers, and Educators.Health Promotion Practice24, 4 (2023), 612–614.\nhttps://doi.org/10.1177/15248399231152468\n[38]V Jo Hsu. 2022.   Irreducible damage: The affective drift of race, gender, and\ndisability in anti-trans rhetorics.Rhetoric Society Quarterly52, 1 (2022), 62–77.\n[39]Ada Hubrig. 2023. Policing trans existence through peda-parrhesia: deploying\nthe rhetorical child.Culture, Theory and Critique64, 1-2 (April 2023), 73–90.\nhttps://doi.org/10.1080/14735784.2024.2366341\n[40]Braedyn D’mitri Inmon. 2023.Imagining a Post-Intentional Phenomenology\nof Cisnormativity: A Philosophical Inquiry.  Ph. D. Dissertation. Slippery Rock\nUniversity of Pennsylvania.\n[41]Isak Løberg Jacobsen. 2022.\" You are either a man or a woman-you can’t do\nboth.\" A critical analysis of transmasculine negotiations of pregnancy, gender and","metadata":{"loc":{"lines":{"from":1011,"to":1025}}}}],["0ab61272-1d08-4e39-8c44-4c8a45ba675e",{"pageContent":"University of Pennsylvania.\n[41]Isak Løberg Jacobsen. 2022.\" You are either a man or a woman-you can’t do\nboth.\" A critical analysis of transmasculine negotiations of pregnancy, gender and\ncisnormativity. Master’s thesis. NTNU.\n[42]Emma Jeanes and Kirsty Janes. 2021. Trans men doing gender at work.Gender,\nWork & Organization28, 4 (2021), 1237–1259.\n[43]Alexander Johnson, Christina Chance, Kaycee Stiemke, Hariram Veeramani,\nNatarajan Balaji Shankar, and Abeer Alwan. 2023.  An Analysis of Large Lan-\nguage Models for African American English Speaking Children’s Oral Language\nAssessment.Journal of Black Excellence in Engineering, Science, & Technology\n(2023).\n[44]Angela Jones. 2020.  Where the trans men and enbies at?: Cissexism, sexual\nthreat, and the study of sex work.Sociology Compass14, 2 (2020), e12750.\n[45]Philip Edward Jones and Paul R. Brewer. 2020. Elite cues and public polarization\non transgender rights.Politics, Groups, and Identities8, 1 (Jan. 2020), 71–85.","metadata":{"loc":{"lines":{"from":1023,"to":1037}}}}],["d44878eb-f4f6-4906-bb71-484456959fcb",{"pageContent":"[45]Philip Edward Jones and Paul R. Brewer. 2020. Elite cues and public polarization\non transgender rights.Politics, Groups, and Identities8, 1 (Jan. 2020), 71–85.\nhttps://doi.org/10.1080/21565503.2018.1441722\n[46]\nS. Mo Jones-Jang, Tara Mortensen, and Jingjing Liu. 2021.  Does Media Liter-\nacy Help Identification of Fake News? Information Literacy Helps, but Other\nLiteracies Don’t.American Behavioral Scientist65, 2 (2021), 371–388.   https:\n//doi.org/10.1177/0002764219869406\n[47]John T. Jost. 2024.  Both-Sideology Endangers Democracy and Social Science.\nJournal of Social Issues80, 3 (Sept. 2024), 1138–1203.   https://doi.org/10.1111/\njosi.12633\n[48]\nNadia Karizat, Dan Delmonaco, Motahhare Eslami, and Nazanin Andalibi. 2021.\nAlgorithmic folk theories and identity: How TikTok users co-produce Knowledge\nof identity and engage in algorithmic resistance.Proceedings of the ACM on\nhuman-computer interaction5, CSCW2 (2021), 1–44.","metadata":{"loc":{"lines":{"from":1036,"to":1051}}}}],["32fc79b3-1b93-4e1a-ae25-ecd45cd1dec7",{"pageContent":"of identity and engage in algorithmic resistance.Proceedings of the ACM on\nhuman-computer interaction5, CSCW2 (2021), 1–44.\n[49]Natacha Kennedy. 2013. Cultural cisgenderism: Consequences of the impercepti-\nble.Psychology of Women Section Review15, 2 (2013), 3–11.\n[50]Vic J. Kennedy. 2023.Tight Coils: Black Transfemininity, Transhegemony, and\nIdentity Formation in The U.S. South. Master’s thesis. Georgia State University.\nhttps://doi.org/10.57709/35544762\n[51]Niki Khanna. 2021. Invisibility and trauma in the intersex community.Violence\nagainst LGBTQ+ persons: Research, practice, and advocacy(2021), 185–194.\n[52]Khushboo Sharma, Khushboo Sharma, Arun Dev Pareek, and Arun Dev Pareek.\n2021. Tactics of Survival: Social Media, Alternative Discourses, and the Rise of\nTrans Narratives.Rupkatha Journal on Interdisciplinary Studies in Humanities13,\n2 (June 2021).  https://doi.org/10.21659/rupkatha.v13n2.44 MAG ID: 3176793687\nS2ID: b197ef5a2e36d6d3076fb787b5dcc470e85e647c.","metadata":{"loc":{"lines":{"from":1050,"to":1063}}}}],["cf5cb480-0902-4c96-9fcb-07315520c4d0",{"pageContent":"2 (June 2021).  https://doi.org/10.21659/rupkatha.v13n2.44 MAG ID: 3176793687\nS2ID: b197ef5a2e36d6d3076fb787b5dcc470e85e647c.\n[53]Elías Cosenza Krell. 2017. Is transmisogyny killing trans women of color? Black\ntrans feminisms and the exigencies of white femininity.Transgender Studies\nQuarterly4, 2 (2017), 226–242.\n[54]Dennis Kundisch, Jan Muntermann, Anna Maria Oberländer, Daniel Rau, Maxi-\nmilian Röglinger, Thorsten Schoormann, and Daniel Szopinski. 2021. An update\nfor taxonomy designers: methodological guidance from information systems\nresearch.Business & Information Systems Engineering(2021), 1–19.\n[55]\nCynthia Lee and Peter Kwan. 2014. The trans panic defense: Masculinity, het-\neronormativity, and the murder of transgender women.Hastings Law Journal66\n(2014), 77.\n[56]MJ Lehvä. 2023.Trans joy: a space for self-realisation, resistance and intersectional\ncommunity building. Ph. D. Dissertation. University of Turku.","metadata":{"loc":{"lines":{"from":1062,"to":1076}}}}],["0b8e09c8-bb0b-46e0-85bb-d0a26b175b41",{"pageContent":"(2014), 77.\n[56]MJ Lehvä. 2023.Trans joy: a space for self-realisation, resistance and intersectional\ncommunity building. Ph. D. Dissertation. University of Turku.\n[57]O Little, A Richards, N Beecham, C Evans, and J Tuthill. 2021. TikTok’s algorithm\nleads users from transphobic videos to far-right rabbit holes. Media Matters.\n[58]Christina Lu and David Jurgens. 2022. The subtle language of exclusion: Identi-\nfying the Toxic Speech of Trans-exclusionary Radical Feminists. InProceedings\nof the sixth workshop on online abuse and harms (WOAH). 79–91.\n[59]Ilan H Meyer. 2003.  Prejudice, social stress, and mental health in lesbian, gay,\nand bisexual populations: conceptual issues and research evidence.Psychological\nbulletin129, 5 (2003), 674.\n[60]   Michael Ann DeVito and Michael A. DeVito. 2022. How Transfeminine TikTok\nCreators Navigate the Algorithmic Trap of Visibility Via Folk Theorization.\nProceedings of the ACM on human-computer interaction6, CSCW2 (Nov. 2022),","metadata":{"loc":{"lines":{"from":1074,"to":1087}}}}],["32132c95-ae16-42fa-84a9-c940194e847c",{"pageContent":"Creators Navigate the Algorithmic Trap of Visibility Via Folk Theorization.\nProceedings of the ACM on human-computer interaction6, CSCW2 (Nov. 2022),\n1–31.  https://doi.org/10.1145/3555105\n[61]Zein Murib. 2022.   Don’t Read the Comments: Examining Social Media Dis-\ncourse on Trans Athletes.Laws11, 4 (July 2022), 53.   https://doi.org/10.3390/\nlaws11040053\n[62]Mahin Naderifar, Hamideh Goli, and Fereshteh Ghaljaie. 2017. Snowball sampling:\nA purposeful method of sampling in qualitative research.Strides in development\nof medical education14, 3 (2017).\n[63]Megan Norris and Catrin Borneskog. 2022.  The Cisnormative Blindspot Ex-\nplained: Healthcare Experiences of Trans Men and Non-Binary Persons and\nthe  accessibility  to  inclusive  sexual  &  reproductive  Healthcare,  an  integra-\ntive  review.Sexual & Reproductive Healthcare32  (2022),  100733.https:\n//doi.org/10.1016/j.srhc.2022.100733\n[64]Nsámbu Za Suékama. 2023.   Racial-Class Paternalism and the Trojan Horse","metadata":{"loc":{"lines":{"from":1086,"to":1100}}}}],["cc686211-29e3-44bf-ad15-1b224b76e4e7",{"pageContent":"tive  review.Sexual & Reproductive Healthcare32  (2022),  100733.https:\n//doi.org/10.1016/j.srhc.2022.100733\n[64]Nsámbu Za Suékama. 2023.   Racial-Class Paternalism and the Trojan Horse\nof  Anti-transmasculinity.https://medium.com/@riptide.1997/racial-class-\npaternalism-and-the-trojan-horse-of-anti-transmasculinity-5b22cf66a00e\n[65]\nGabriela Pinto, Keith Burghardt, Kristina Lerman, and Emilio Ferrara. 2024.\nGET-Tok: A GenAI-Enriched Multimodal TikTok Dataset Documenting the 2022\nAttempted Coup in Peru.  arXiv:2402.05882 [cs.SI]  https://arxiv.org/abs/2402.\n05882\n[66]\nLucas R Platero. 2023. Strange bedfellows: anti-trans feminists, VOX supporters\nand biologicist academics.DiGeSt-Journal of Diversity and Gender Studies10, 2\n(2023).\n[67]Lex Pulice-Farrow. 2024.“If they look at me and land at he/him, it’s the consolation\nprize”’: Transmasculine nonbinary individuals’ conceptualization of passing. Ph. D.\nDissertation. University of Tennessee.  https://trace.tennessee.edu/utk_graddiss/","metadata":{"loc":{"lines":{"from":1098,"to":1114}}}}],["8c5e4111-a50f-446b-ba3b-c973886783f4",{"pageContent":"prize”’: Transmasculine nonbinary individuals’ conceptualization of passing. Ph. D.\nDissertation. University of Tennessee.  https://trace.tennessee.edu/utk_graddiss/\n10494/ Accessed: 2024-12-04.\n[68]Alec Radford, Jong Wook Kim, Tao Xu, Greg Brockman, Christine McLeavey, and\nIlya Sutskever. 2023. Robust speech recognition via large-scale weak supervision.\nInInternational conference on machine learning. PMLR, 28492–28518.\n[69]Baker A Rogers. 2019.   “Contrary to all the other shit I’ve said”: Trans men\npassing in the south.Qualitative Sociology42, 4 (2019), 639–662.\n[70]Lauren Rosewarne. 2023.  The good transsexual? The Buck Angel dilemmas.\nPorn Studies0, 0 (2023), 1–31.   https://doi.org/10.1080/23268743.2023.2221252\narXiv:https://doi.org/10.1080/23268743.2023.2221252\n[71]\nMorgan Klaus Scheuerman, Alex Hanna, and Emily Denton. 2021. Do Datasets\nHave Politics? Disciplinary Values in Computer Vision Dataset Development.","metadata":{"loc":{"lines":{"from":1113,"to":1126}}}}],["9c4f464d-a461-4efa-9a4b-51428bba9e3e",{"pageContent":"[71]\nMorgan Klaus Scheuerman, Alex Hanna, and Emily Denton. 2021. Do Datasets\nHave Politics? Disciplinary Values in Computer Vision Dataset Development.\nProc. ACM Hum.-Comput. Interact.5, CSCW2 (Oct. 2021), 1–37.   https://doi.org/\n10.1145/3476058\n[72]Samantha Schmidt. 2020. Conservatives find unlikely ally in fighting transgender\nrights: radical feminists.The Washington Post(2020), NA–NA.\n[73]Irina Schmitt. 2019.  Understanding cis-normativity in higher education class-\nrooms. InLund University’s Teaching and Learning Conference 2019.\n[74]\nJulia Serano. 2016.Whipping girl: A transsexual woman on sexism and the scape-\ngoating of femininity. Hachette UK.\n[75]\nStef M Shuster and Laurel Westbrook. 2022. Reducing the Joy Deficit in Sociology:\nA Study of Transgender Joy.Social Problems71, 3 (June 2022), 791–809.   https:\n//doi.org/10.1093/socpro/spac034\n[76]\nJulia Srouji. 2022.Transgender TikTok: Analyzing Insider and Outsider Perspectives","metadata":{"loc":{"lines":{"from":1124,"to":1141}}}}],["bd715395-f252-403c-adac-a83ab6709821",{"pageContent":"A Study of Transgender Joy.Social Problems71, 3 (June 2022), 791–809.   https:\n//doi.org/10.1093/socpro/spac034\n[76]\nJulia Srouji. 2022.Transgender TikTok: Analyzing Insider and Outsider Perspectives\nof a Heavily Debated Topic. Ph. D. Dissertation. Concordia University.\n[77]\nStuart J. Turnbull-Dugarte and Fraser McMillan. 2023.  “Protect the women!”\nTrans-exclusionary feminist issue framing and support for transgender rights.\nPolicy Studies Journal51, 3 (Aug. 2023), 629–666.\n[78]Alok Vaid-Menon and Janani Balasubramanian. 2014.  Trans Activism in the\nWake of the Darren Wilson Verdict.Guest lecture, Vassar College, Poughkeepsie,\nNY, November25 (2014).\n[79]Vergess.  2016.XOR  Gender  Chart.https://vergess.tumblr.com/post/\n143919554200/xor-gender-chart\n[80]David L Wallace. 2002. Out in the academy: Heterosexism, invisibility, and double\nconsciousness.College English65, 1 (2002), 53–66.\n[81]Zeerak Waseem. 2016.  Are You a Racist or Am I Seeing Things? Annotator","metadata":{"loc":{"lines":{"from":1138,"to":1154}}}}],["8bcc7ae3-9394-4496-9aea-57b6f87ae383",{"pageContent":"consciousness.College English65, 1 (2002), 53–66.\n[81]Zeerak Waseem. 2016.  Are You a Racist or Am I Seeing Things? Annotator\nInfluence on Hate Speech Detection on Twitter. InProceedings of the First Work-\nshop on NLP and Computational Social Science. Association for Computational\nLinguistics, Austin, Texas, 138–142.  https://doi.org/10.18653/v1/W16-5618\n[82]\nGabriel Weimann and Natalie Masri. 2023.   Research Note: Spreading Hate\non TikTok.Studies in Conflict & Terrorism46, 5 (May 2023), 752–765.   https:\n//doi.org/10.1080/1057610X.2020.1780027\n[83]\nLaurel Westbrook and Stef M Shuster. 2023. Transgender joy: flipping the script\nof marginality.Contexts22, 4 (2023), 16–21.\n[84]Meredith GF Worthen. 2021. Why can’t you just pick one? The stigmatization of\nnon-binary/genderqueer people by cis and trans men and women: An empirical\ntest of norm-centered stigma theory.Sex Roles85, 5 (2021), 343–356.","metadata":{"loc":{"lines":{"from":1153,"to":1167}}}}],["9af60f50-930c-4e84-92c4-16bb30808bd9",{"pageContent":"Characterizing Network Structure of Anti-Trans Actors on TikTok\n[85]Xuhui Zhou, Hao Zhu, Akhila Yerukola, Thomas Davidson, Jena D Hwang,\nSwabha Swayamdipta, and Maarten Sap. 2023.   COBRA Frames: Contextual\nReasoning about Effects and Harms of Offensive Statements. InFindings of the\nAssociation for Computational Linguistics: ACL 2023. 6294–6315.\n[86]Bruno Zirnstein. 2023.Extended context for InstructGPT with LlamaIndex. Tech-\nnical Report. Hochschule für Wirtschaft und Recht Berlin.","metadata":{"loc":{"lines":{"from":1169,"to":1175}}}}]],{"0":"cf991a9e-80ee-4bb7-9af3-fe15f821f888","1":"1dfbdfaa-4f61-4083-9289-27d41a1ed180","2":"4e05a8ac-d926-445e-8132-e73e0986aa82","3":"dd577af5-5f79-4223-a578-cacd6b695a04","4":"10a01030-76d8-4d45-9bf3-ee1e2a0c290e","5":"4b46b8f0-6f95-43c8-bb2f-3c05c651ae28","6":"3dadba37-cba4-4149-903a-04f27d619392","7":"f58bbc6f-00d0-4591-8c0b-774717765b5e","8":"78804179-5270-4164-80e1-6a378d2ae6e4","9":"7ba03287-ce4f-4cc2-b0b6-b859dcd490c4","10":"10d6aeb1-2ca9-4458-901f-9f975dea6b5e","11":"350965a2-6a2f-4188-9086-bdb600d81943","12":"cb70bcf0-0674-4050-8611-373a9c70ad8c","13":"72c0c384-03c6-4801-b896-e270983b70fd","14":"d2fc8ba7-97b9-4b74-8455-95aaa38f6462","15":"01f02c28-f8cc-4ab7-858a-0da8bd524007","16":"351161ee-2079-4f3f-abd0-2640589a1595","17":"497cca03-87a3-4a25-b905-53eb947f9226","18":"d0b36209-7f7c-46bb-b36c-8ad41f10e422","19":"359076b1-cb39-4f47-8e91-ebfc23f57aa3","20":"39905bd0-880d-472c-9ea4-09264c6e8c7e","21":"6000787f-415e-41b1-8465-bd8e9935f09c","22":"06d7136a-504b-40d8-9219-0c2d3f5f0538","23":"10ad0736-978a-4247-bcb0-f9180a2dec36","24":"21bcb250-29ce-4cec-a12e-fa4322c73317","25":"79dffc4f-cd4c-43bd-9b20-5fe80bf473ee","26":"fc3a756c-cf5e-4b0c-84e4-1b81f0bb3d01","27":"45216bb2-b4e5-4cba-89a8-d6becd1f3bc9","28":"59885b44-d64b-4dd4-8852-a2848e9fcec7","29":"a144f4e6-95cf-4710-8235-2abd6a9bee7c","30":"eeda1674-a33d-4e30-8c7c-93a67eb975ab","31":"ce404995-bd2f-4a74-8a10-5d096e039585","32":"08d8cd61-ae96-4044-9163-0fdba5f1f13b","33":"5a8c8ef2-916c-4e92-877f-68242080d46f","34":"2339bf1b-205b-486e-afb5-c043c5814f30","35":"04833cda-d169-451f-93d1-df0d00cb804a","36":"add5aa66-4ab7-498c-b91c-86c5249132f1","37":"4c9a3ed3-ac14-48b4-a0e3-1d782ba3fbae","38":"2df126fc-0348-4406-9010-3d20e488bb98","39":"8ed69015-ae77-4162-a049-2dcdc941eab1","40":"2953629e-ced4-475f-a356-97d197f77680","41":"fa064636-036b-40f3-872e-26b46e2233b6","42":"34bf2b7b-d185-4e46-a184-5b975b28fb37","43":"18741a2d-b30d-4774-8cf5-c4538eea3d8c","44":"c5ca453a-3847-4dbc-8351-b16799d242f4","45":"72eae99c-1da3-4430-a876-c85b80bc444d","46":"b256e3a8-36cf-46e0-af7c-2b5185a34f2a","47":"c236bcd1-c007-436e-bce2-63cb54471841","48":"6978566e-83a0-45bc-a2bd-f98dc66b9ce6","49":"dd047818-3129-4ba3-ab25-6ed0162ed363","50":"f4cba50c-0f26-4402-9f2a-1d82f9651501","51":"9064414c-6148-4ef0-9413-b0177739a136","52":"144975b6-199d-4cca-9ddd-fd7abdab643e","53":"7f43346c-aa53-4be9-be03-9846e6cf60c7","54":"812979fd-892f-45a4-b460-655d25d641a6","55":"612586ca-3756-4ba3-a725-15a303caaef8","56":"e31fa3b6-a2af-41a2-acb3-f5479121ef1c","57":"625397f6-84a7-4df6-a303-ee21483a08e5","58":"a2d863f3-b8d8-45e0-9062-13951b02f01a","59":"cc70e863-1ae1-40fc-98d6-876c53c1955e","60":"0431ba65-3ab6-47ba-a897-c86b618ca7da","61":"4a22440d-a1a5-4570-81ce-e8770a8a7fa6","62":"4d57ac5e-8f4e-417e-aced-c5fd9ef4d069","63":"c727b346-677b-4894-b729-f507574595ac","64":"631524af-8dc2-483e-8c4c-728020bb12da","65":"47764e89-01b1-49db-a077-b4f02e4d99eb","66":"ce4abe66-c468-4faa-9050-2a9ea7b773e4","67":"a8eb6d27-4f33-462d-b92d-ad2346512796","68":"baf13f78-1998-41df-bd5d-7153dc5a8ce5","69":"e527c977-7f23-4776-95a7-fcf22e5aaf9d","70":"c5b04f18-19bd-44c2-a947-b6fc2badbf42","71":"b0eae78a-0f0c-4a81-90be-89eead51c950","72":"0f70a8b2-315e-4eeb-a93e-92b4635f6f02","73":"1c9e5c10-cf7a-4b6a-9251-623dd04e50d4","74":"0ab61272-1d08-4e39-8c44-4c8a45ba675e","75":"d44878eb-f4f6-4906-bb71-484456959fcb","76":"32fc79b3-1b93-4e1a-ae25-ecd45cd1dec7","77":"cf5cb480-0902-4c96-9fcb-07315520c4d0","78":"0b8e09c8-bb0b-46e0-85bb-d0a26b175b41","79":"32132c95-ae16-42fa-84a9-c940194e847c","80":"cc686211-29e3-44bf-ad15-1b224b76e4e7","81":"8c5e4111-a50f-446b-ba3b-c973886783f4","82":"9c4f464d-a461-4efa-9a4b-51428bba9e3e","83":"bd715395-f252-403c-adac-a83ab6709821","84":"8bcc7ae3-9394-4496-9aea-57b6f87ae383","85":"9af60f50-930c-4e84-92c4-16bb30808bd9"}]